# ETL/ELT

### 4.2.3

# SQL

File URL:

https://storage.googleapis.com/summer-school-pfds-2020/city.db

Use `sqlite3` to connect to the `city.db` database file, select all rows and print.

In [ ]:
...

### SQL + Pandas
Use `sqlite3` to connect to the database and `pandas` `read_sql` to select the data into a DataFrame

In [17]:
...

              name population
0          Abilene     115930
1            Akron     217074
2           Albany      93994
3      Albuquerque     448607
4       Alexandria     128283
..             ...        ...
269        Wichita     344284
270  Wichita Falls     104197
271  Winston-Salem     185776
272      Worcester     172648
273        Yonkers     196086

[274 rows x 2 columns]

### SQLAlchemy + Pandas
Use `sqlalchemy`'s `create_engine` function to create a connection engine, and `pandas` `read_sql` to query the database.

In [ ]:
...